ruby/example-rails-jms/order-web/app/controllers/orders_controller.rb

  def create
    if request.xhr?
      order = Order.new(params[:order])
      order.status = 'PENDING'
      order.save!
---
INSERT INTO `orders` (`status`, `updated_at`, `description`, `created_at`) VALUES('PROCESSING', '2009-10-08 22:55:43', 'foo', '2009-10-08 22:55:43')

  def delete
    if request.xhr?
      Order.find(params[:id]).destroy
---
DELETE FROM `orders` WHERE `id` = 2
SELECT * FROM `orders` WHERE (`orders`.`id` = 2)